src/cf/Enums/уатВидыДокументовШаблонаДоходовРасходов_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыДокументовШаблонаДоходовРасходов_уэ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутныйЛист</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>(Общ) Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесовойКоэффициентВхождения</Name>
					<Comment>(Упр) Весовой коэффициент вхождения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment>(Регл) Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаРегл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатВидУпаковкиОсновной</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыУпаковки_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатКоличествоВОсновнойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатВидУпаковкиДляРоссыпи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыУпаковки_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатКоличествоВУпаковкеДляРоссыпи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатВидГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьЭтикетокДляКаждойЕдиницыНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьУПДиСФсПустымКоличеством</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельСпецодеждыИлиИнструмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиСпецодеждыИИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GDS_КодНСИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕТСНГ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГНГ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыГНГ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатСтатьиРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСтатьиРасходов</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокОтнесенияЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПорядкиОтнесенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.уатРегламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособыРаспределенияДоходовРасходовМеждуТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСпособаРаспределенияЗатрат</Name>
					<Comment>Вариант способа распределения между ТС по объему выработки. 0 - общий, 1 - по колоннам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСпособаРаспределенияЗатратМеждуАналитиками</Name>
					<Comment>Вариант способа распределения между аналитиками по объему выработки. 0 - общий, 1 - по колоннам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаРБП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределениеНепрямыхРасходовПоЗаказам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРаспределениеНепрямыхДоходовРасходовПоЗаказам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКопироватьПлановыеРасходыВФактические</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеРасходовПоСцепкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияВнутриСцепки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособРаспределенияВнутриСцепки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуЗаказами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВыработкиРаспределенияМеждуТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Колонна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВыработкиРаспределенияМеждуАналитиками</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Колонна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРаспределенияЗатратМеждуАналитиками</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрямыеРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/уатОбщегоНазначенияКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Процедуры и функции общего назначения, перенесенные из типовых конфигураций.
// 
// Содержит код, используемый в варианте поставке СТД, ПРОФ, КОРП
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает структуру документа
// Используется при расчете доходов и расходов в документах логистики
//
Функция СтруктураДокумента(Объект, ИмяДокумента, ДопПараметры = Неопределено) Экспорт
	Рез = Новый Структура;
	Рез.Вставить("ИмяДокумента", ИмяДокумента);
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	Если НЕ ДопПараметры.Свойство("ЗаполнятьТЧДоходы") Тогда
		ДопПараметры.Вставить("ЗаполнятьТЧДоходы", Истина);
	КонецЕсли;
	Если НЕ ДопПараметры.Свойство("ЗаполнятьТЧРасходы") Тогда
		ДопПараметры.Вставить("ЗаполнятьТЧРасходы", Истина);
	КонецЕсли;
	Если ИмяДокумента = "уатПотребностьВПеревозке_уэ" И НЕ ДопПараметры.Свойство("IDСтрокиПотребности") Тогда
		ДопПараметры.Вставить("IDСтрокиПотребности", "");
	КонецЕсли;
	Если Не ДопПараметры.Свойство("ЗаполнятьТЧОтрезкиПути") Тогда
		ДопПараметры.Вставить("ЗаполнятьТЧОтрезкиПути", Ложь);
	КонецЕсли;
	Если Не ДопПараметры.Свойство("ЗаполнятьВсеКолонкиТЧТовары") Тогда
		ДопПараметры.Вставить("ЗаполнятьВсеКолонкиТЧТовары", Ложь);
	КонецЕсли;
	Если Не ДопПараметры.Свойство("ЗаполнятьВсеКолонкиТЧГрузовойСостав") Тогда
		ДопПараметры.Вставить("ЗаполнятьВсеКолонкиТЧГрузовойСостав", Ложь);
	КонецЕсли;
	
	мсвРеквизитыШапки = уатРаботаСМетаданными.РеквизитыШапкиДокумента(ИмяДокумента);
	Для Каждого ТекРеквизитИмя Из мсвРеквизитыШапки Цикл
		Рез.Вставить(ТекРеквизитИмя, Объект[ТекРеквизитИмя]);
	КонецЦикла;
		
	Если ИмяДокумента = "уатМаршрутныйЛист" Тогда
		РасходыСтруктураСтроки = Новый Структура;
		РасходыСтруктураСтроки.Вставить("Количество", 0);
		РасходыСтруктураСтроки.Вставить("КоличествоПлан", 0);
		РасходыСтруктураСтроки.Вставить("Цена", 0);
		РасходыСтруктураСтроки.Вставить("ЦенаПлан", 0);
		РасходыСтруктураСтроки.Вставить("Сумма", 0);
		РасходыСтруктураСтроки.Вставить("СуммаПлан", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДС", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДСПлан", 0);
		РасходыСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Курс", 0);
		РасходыСтруктураСтроки.Вставить("Кратность", 0);
		РасходыСтруктураСтроки.Вставить("УчитыватьНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("СуммаВключаетНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Содержание", "");
		РасходыСтруктураСтроки.Вставить("Тариф", Неопределено);
		РасходыСтруктураСтроки.Вставить("ЗаказНаТС", ПредопределенноеЗначение("Документ.уатЗаказГрузоотправителя.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("ЗаказПеревозчику", ПредопределенноеЗначение("Документ.уатЗаказПеревозчику_уэ.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Контрагент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Договор", ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтатьяРасходов", ПредопределенноеЗначение("Справочник.уатСтатьиРасходов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		РасходыСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		
		Рез.Вставить("РасходыСтруктураСтроки", РасходыСтруктураСтроки);
		
		ДоходыСтруктураСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РасходыСтруктураСтроки);
		ДоходыСтруктураСтроки.Тариф = ПредопределенноеЗначение("Справочник.уатТарифыТС.ПустаяСсылка");
		ДоходыСтруктураСтроки.Удалить("ЗаказПеревозчику");
		ДоходыСтруктураСтроки.Удалить("Контрагент");
		ДоходыСтруктураСтроки.Удалить("Договор");
		ДоходыСтруктураСтроки.Удалить("СтатьяРасходов");
		ДоходыСтруктураСтроки.Вставить("СтатьяДоходов", ПредопределенноеЗначение("Справочник.уатСтатьиДоходов.ПустаяСсылка"));
				
		Рез.Вставить("ДоходыСтруктураСтроки", ДоходыСтруктураСтроки);
		
		мсвЗаказы = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Заказы Цикл
			СтруктураСтрокиЗаказы = Новый Структура("НомерСтроки, GUIDСтроки,Выполнен, ДатаВыполнения,
			|ЗаказГрузоотправителя, Пункт, ТипТочкиМаршрута, ВесБрутто, Объем, Время, Расстояние,
			|ПробегПорожний, ПробегСГрузом, Стоянка, СтоянкаИзПункта, Выработка1, Выработка2,Выработка3,Выработка4,Выработка5,
			|ПараметрВыработки1,ПараметрВыработки2,ПараметрВыработки3,ПараметрВыработки4,ПараметрВыработки5,
			|ЕдиницаИзмерения, ЕдиницаИзмеренияПоЗаказу, Количество, КоличествоМест, Контрагент,
			|Номенклатура, ПрибытиеПлан, ПрибытиеФакт, УбытиеПлан, УбытиеФакт, Ожидание,СтоянкаФакт,ОжиданиеФакт,РасстояниеФакт,ВремяФакт,
			|ОтветMultiGo,ОценкаСервиса,Подпись,ДатаВыбораВодителем,УбытиеФактUTC,ПрибытиеФактUTC"
			,,,,,,,,,,,,,,,,0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, "",0,"",Дата(1,1,1),Дата(1,1,1),Дата(1,1,1));
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиЗаказы, ТекСтрока);
			мсвЗаказы.Добавить(СтруктураСтрокиЗаказы);
		КонецЦикла;
		Рез.Вставить("Заказы", мсвЗаказы);
		
		мсвВыработка = Новый Массив;
		Для Каждого ТекСтрока Из Объект.УдалитьВыработка Цикл
			СтруктураСтрокиВыработка = Новый Структура("ПараметрВыработки, Значение",, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыработка, ТекСтрока);
			мсвВыработка.Добавить(СтруктураСтрокиВыработка);
		КонецЦикла;
		Рез.Вставить("УдалитьВыработка", мсвВыработка);
		
		мсвВыработкаТСиСотрудников = Новый Массив;
		Для Каждого ТекСтрока Из Объект.ВыработкаТСиСотрудников Цикл
			СтруктураСтрокиВыработкаТСиСотрудников = Новый Структура(
				"НомерСтроки, ЗаказГрузоотправителя, ПараметрВыработки, КоличествоПлан, КоличествоФакт"
				+ ", Контрагент, Подразделение, Маршрут, ОбъектСтроительства, ВидПеревозки, НаправлениеПеревозки, ДопАналитика");
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыработкаТСиСотрудников, ТекСтрока);
			мсвВыработкаТСиСотрудников.Добавить(СтруктураСтрокиВыработкаТСиСотрудников);
		КонецЦикла;
		Рез.Вставить("ВыработкаТСиСотрудников", мсвВыработкаТСиСотрудников);
		
		// ТЧ Доходы
		мсвТЧ = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧДоходы Тогда
			Для Каждого ТекСтрока Из Объект.Доходы Цикл
				СтруктураСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДоходыСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекСтрока);
				мсвТЧ.Добавить(СтруктураСтроки);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Доходы", мсвТЧ);
		
		// ТЧ Расходы
		мсвТЧ = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧРасходы Тогда
			Для Каждого ТекСтрока Из Объект.Расходы Цикл
				СтруктураСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РасходыСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекСтрока);
				мсвТЧ.Добавить(СтруктураСтроки);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Расходы", мсвТЧ);
		
	ИначеЕсли ИмяДокумента = "уатЗаказГрузоотправителя" Тогда
		УслугиСтруктураСтроки = Новый Структура;
		УслугиСтруктураСтроки.Вставить("Количество", 0);
		УслугиСтруктураСтроки.Вставить("КоличествоПлан", 0);
		УслугиСтруктураСтроки.Вставить("Цена", 0);
		УслугиСтруктураСтроки.Вставить("ЦенаПлан", 0);
		УслугиСтруктураСтроки.Вставить("Сумма", 0);
		УслугиСтруктураСтроки.Вставить("СуммаПлан", 0);
		УслугиСтруктураСтроки.Вставить("СуммаНДС", 0);
		УслугиСтруктураСтроки.Вставить("СуммаНДСПлан", 0);
		УслугиСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("Курс", 0);
		УслугиСтруктураСтроки.Вставить("Кратность", 0);
		УслугиСтруктураСтроки.Вставить("Содержание", "");
		УслугиСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("Тариф", ПредопределенноеЗначение("Справочник.уатТарифыТС.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СтатьяДоходов", ПредопределенноеЗначение("Справочник.уатСтатьиДоходов.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		УслугиСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		УслугиСтруктураСтроки.Вставить("ПроцентСкидки", 0);
		УслугиСтруктураСтроки.Вставить("СуммаСкидки", 0);
		УслугиСтруктураСтроки.Вставить("СуммаСкидкиПлан", 0);
		УслугиСтруктураСтроки.Вставить("ВидДокумента", ПредопределенноеЗначение("Перечисление.уатВидыДокументовШаблонаДоходовРасходов_уэ.ПустаяСсылка"));
		Рез.Вставить("УслугиСтруктураСтроки", УслугиСтруктураСтроки);
		
		РасходыСтруктураСтроки = Новый Структура;
		РасходыСтруктураСтроки.Вставить("Количество", 0);
		РасходыСтруктураСтроки.Вставить("КоличествоПлан", 0);
		РасходыСтруктураСтроки.Вставить("Цена", 0);
		РасходыСтруктураСтроки.Вставить("ЦенаПлан", 0);
		РасходыСтруктураСтроки.Вставить("Сумма", 0);
		РасходыСтруктураСтроки.Вставить("СуммаПлан", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДС", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДСПлан", 0);
		РасходыСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("УчитыватьНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("СуммаВключаетНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Содержание", "");
		РасходыСтруктураСтроки.Вставить("Тариф", Неопределено);
		РасходыСтруктураСтроки.Вставить("Контрагент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Договор", ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтатьяРасходов", ПредопределенноеЗначение("Справочник.уатСтатьиРасходов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		РасходыСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		РасходыСтруктураСтроки.Вставить("ВидДокумента", ПредопределенноеЗначение("Перечисление.уатВидыДокументовШаблонаДоходовРасходов_уэ.ПустаяСсылка"));
		Рез.Вставить("РасходыСтруктураСтроки", РасходыСтруктураСтроки);
		
		мсвВыработка = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Выработка Цикл
			СтруктураСтрокиВыработка = Новый Структура("ПараметрВыработки, Значение",, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыработка, ТекСтрока);
			мсвВыработка.Добавить(СтруктураСтрокиВыработка);
		КонецЦикла;
		Рез.Вставить("Выработка", мсвВыработка);
		
		// ТЧ Доходы
		мсвУслуги = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧДоходы Тогда
			Для Каждого ТекСтрока Из Объект.Услуги Цикл
				СтруктураСтрокиУслуги = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(УслугиСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиУслуги, ТекСтрока);
				мсвУслуги.Добавить(СтруктураСтрокиУслуги);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Услуги", мсвУслуги);
		
		// ТЧ Расходы
		мсвТЧ = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧРасходы Тогда
			Для Каждого ТекСтрока Из Объект.Расходы Цикл
				СтруктураСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РасходыСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекСтрока);
				мсвТЧ.Добавить(СтруктураСтроки);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Расходы", мсвТЧ);
		
		Если Объект.FTL Тогда
			мсвПункты = Новый Массив;
			Для Каждого ТекСтрока Из Объект.ПромежуточныеПункты Цикл
				СтруктураСтрокиПромежуточныеПункты = Новый Структура(
					"Пункт, ТипТочкиМаршрута, ОтправительПолучатель, КонтактноеЛицо, Ожидание,
					|ПрибытиеПлан, УбытиеПлан, Стоянка, Расстояние, Время, Длительность"
				);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиПромежуточныеПункты, ТекСтрока);
				мсвПункты.Добавить(СтруктураСтрокиПромежуточныеПункты);
			КонецЦикла;
			Рез.Вставить("ПромежуточныеПункты", мсвПункты);
			
			мсвОтрезкиПути = Новый Массив;
			Для Каждого ТекСтрока Из Объект.ОтрезкиПути Цикл
				Если ДопПараметры.ЗаполнятьТЧОтрезкиПути Тогда
					СтруктураСтрокиОтрезкиПути = Новый Структура("id, ПунктОтправления, ПунктНазначения, Груз");
					ЗаполнитьЗначенияСвойств(СтруктураСтрокиОтрезкиПути, ТекСтрока);
					мсвОтрезкиПути.Добавить(СтруктураСтрокиОтрезкиПути);
				КонецЕсли;
			КонецЦикла;
			Рез.Вставить("ОтрезкиПути", мсвОтрезкиПути);
		КонецЕсли;
		
		//Если Объект.ДетализацияЗакрытия =
		//ПредопределенноеЗначение("Перечисление.уатДетализацияЗаказаГрузоотправителя_уэ.ПоТоварам") Тогда
		мсвТовары = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Товары Цикл
			Если ДопПараметры.ЗаполнятьВсеКолонкиТЧТовары Тогда
				СтруктураСтрокиТовары = Новый Структура("Номенклатура, ЕдиницаИзмерения, ГрузовоеМесто, Количество, Комментарий,
					|ВесБрутто, Объем, КоличествоМест, Цена, Сумма, СтавкаНДС, СуммаНДС, ВесТары, ПричинаЗакрытия");
			Иначе
				СтруктураСтрокиТовары = Новый Структура("Номенклатура, ЕдиницаИзмерения, ГрузовоеМесто, Количество, КоличествоМест");
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиТовары, ТекСтрока);
			мсвТовары.Добавить(СтруктураСтрокиТовары);
		КонецЦикла;
		Рез.Вставить("Товары", мсвТовары);
		//КонецЕсли;
		
		//Если Объект.ДетализацияЗакрытия =
		//ПредопределенноеЗначение("Перечисление.уатДетализацияЗаказаГрузоотправителя_уэ.ПоГрузовымМестам") Тогда
		мсвГрузовойСостав = Новый Массив;
		Для Каждого ТекСтрока Из Объект.ГрузовойСостав Цикл
			Если ДопПараметры.ЗаполнятьВсеКолонкиТЧГрузовойСостав Тогда
				СтруктураСтрокиГрузовойСостав = Новый Структура("ГрузовоеМесто, ВидУпаковки, ВесБрутто, Объем, КоличествоМест,
					|Высота, Длина, Ширина, Стоимость, ОписаниеГруза, ВесТары, ПричинаЗакрытия");
			Иначе
				СтруктураСтрокиГрузовойСостав = Новый Структура("ГрузовоеМесто, ВидУпаковки, ВесБрутто, Объем, КоличествоМест,
					|Высота, Длина, Ширина");
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиГрузовойСостав, ТекСтрока);
			мсвГрузовойСостав.Добавить(СтруктураСтрокиГрузовойСостав);
		КонецЦикла;
		Рез.Вставить("ГрузовойСостав", мсвГрузовойСостав);
		//КонецЕсли;
		
	ИначеЕсли ИмяДокумента = "такЗаказТакси" Тогда
		УслугиСтруктураСтроки = Новый Структура;
		УслугиСтруктураСтроки.Вставить("Количество", 0);
		УслугиСтруктураСтроки.Вставить("Цена", 0);
		УслугиСтруктураСтроки.Вставить("Сумма", 0);
		УслугиСтруктураСтроки.Вставить("СуммаНДС", 0);
		УслугиСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("Курс", 0);
		УслугиСтруктураСтроки.Вставить("Кратность", 0);
		УслугиСтруктураСтроки.Вставить("Содержание", "");
		УслугиСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("Тариф", ПредопределенноеЗначение("Справочник.уатТарифыТС.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СтатьяДоходов", ПредопределенноеЗначение("Справочник.уатСтатьиДоходов.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		УслугиСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		УслугиСтруктураСтроки.Вставить("ПроцентСкидки", 0);
		УслугиСтруктураСтроки.Вставить("СуммаСкидки", 0);
		Рез.Вставить("УслугиСтруктураСтроки", УслугиСтруктураСтроки);
		
		РасходыСтруктураСтроки = Новый Структура;
		РасходыСтруктураСтроки.Вставить("Количество", 0);
		РасходыСтруктураСтроки.Вставить("Цена", 0);
		РасходыСтруктураСтроки.Вставить("Сумма", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДС", 0);
		РасходыСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("УчитыватьНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("СуммаВключаетНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Содержание", "");
		РасходыСтруктураСтроки.Вставить("Тариф", Неопределено);
		РасходыСтруктураСтроки.Вставить("Контрагент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Договор", ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтатьяРасходов", ПредопределенноеЗначение("Справочник.уатСтатьиРасходов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		РасходыСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		Рез.Вставить("РасходыСтруктураСтроки", РасходыСтруктураСтроки);
		
		мсвВыработка = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Выработка Цикл
			СтруктураСтрокиВыработка = Новый Структура("ПараметрВыработки, Значение",, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыработка, ТекСтрока);
			мсвВыработка.Добавить(СтруктураСтрокиВыработка);
		КонецЦикла;
		Рез.Вставить("Выработка", мсвВыработка);
		
		// ТЧ Доходы
		мсвУслуги = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧДоходы Тогда
			Для Каждого ТекСтрока Из Объект.Услуги Цикл
				СтруктураСтрокиУслуги = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(УслугиСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиУслуги, ТекСтрока);
				мсвУслуги.Добавить(СтруктураСтрокиУслуги);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Услуги", мсвУслуги);
		
		// ТЧ Расходы
		мсвТЧ = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧРасходы Тогда
			Для Каждого ТекСтрока Из Объект.Расходы Цикл
				СтруктураСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РасходыСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекСтрока);
				мсвТЧ.Добавить(СтруктураСтроки);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Расходы", мсвТЧ);
		
	ИначеЕсли ИмяДокумента = "уатЗаказПеревозчику_уэ" Тогда
		РасходыСтруктураСтроки = Новый Структура;
		РасходыСтруктураСтроки.Вставить("Количество", 0);
		РасходыСтруктураСтроки.Вставить("КоличествоПлан", 0);
		РасходыСтруктураСтроки.Вставить("Цена", 0);
		РасходыСтруктураСтроки.Вставить("ЦенаПлан", 0);
		РасходыСтруктураСтроки.Вставить("Сумма", 0);
		РасходыСтруктураСтроки.Вставить("СуммаПлан", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДС", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДСПлан", 0);
		РасходыСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Курс", 0);
		РасходыСтруктураСтроки.Вставить("Кратность", 0);
		РасходыСтруктураСтроки.Вставить("Груз", ПредопределенноеЗначение("Документ.уатЗаказГрузоотправителя.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Тариф", ПредопределенноеЗначение("Справочник.уатТарифыТС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтатьяРасходов", ПредопределенноеЗначение("Справочник.уатСтатьиРасходов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		РасходыСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		
		Рез.Вставить("РасходыСтруктураСтроки", РасходыСтруктураСтроки);
		
		мсвВыработка = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Выработка Цикл
			СтруктураСтрокиВыработка = Новый Структура("ПараметрВыработки, Значение",, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыработка, ТекСтрока);
			мсвВыработка.Добавить(СтруктураСтрокиВыработка);
		КонецЦикла;
		Рез.Вставить("Выработка", мсвВыработка);
		
		мсвГрузы = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Грузы Цикл
			СтруктураСтрокиГрузы = Новый Структура("Заказ, ГрузовоеМесто, Количество, ЕдиницаИзмерения",,, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиГрузы, ТекСтрока);
			мсвГрузы.Добавить(СтруктураСтрокиГрузы);
		КонецЦикла;
		Рез.Вставить("Грузы", мсвГрузы);
		
		мсвРасходы = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧРасходы Тогда
			Для Каждого ТекСтрока Из Объект.Расходы Цикл
				СтруктураСтрокиРасходы = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РасходыСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиРасходы, ТекСтрока);
				мсвРасходы.Добавить(СтруктураСтрокиРасходы);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Расходы", мсвРасходы);
		
	ИначеЕсли ИмяДокумента = "уатСтраховойСертификат_уэ" Тогда
		РасходыСтруктураСтроки = Новый Структура;
		РасходыСтруктураСтроки.Вставить("Количество",       0); 
		РасходыСтруктураСтроки.Вставить("КоличествоПлан",   0);
		РасходыСтруктураСтроки.Вставить("Цена",             0);
		РасходыСтруктураСтроки.Вставить("ЦенаПлан",         0);
		РасходыСтруктураСтроки.Вставить("Сумма",            0); 
		РасходыСтруктураСтроки.Вставить("СуммаПлан",        0);
		РасходыСтруктураСтроки.Вставить("СуммаНДС",         0); 
		РасходыСтруктураСтроки.Вставить("СуммаНДСПлан",     0);
		РасходыСтруктураСтроки.Вставить("Валюта",           ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Курс",             0);
		РасходыСтруктураСтроки.Вставить("Кратность",        0);
		РасходыСтруктураСтроки.Вставить("ЗаказНаТС",        ПредопределенноеЗначение("Документ.уатЗаказГрузоотправителя.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Номенклатура",     ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтавкаНДС",        ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Тариф",            ПредопределенноеЗначение("Справочник.уатТарифыТС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтатьяРасходов",   ПредопределенноеЗначение("Справочник.уатСтатьиРасходов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("УчитыватьНДС",     Ложь);
		РасходыСтруктураСтроки.Вставить("СуммаВключаетНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("Ставка",           0);
		РасходыСтруктураСтроки.Вставить("СтавкаПлан",       0);
		РасходыСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		РасходыСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		
		Рез.Вставить("РасходыСтруктураСтроки", РасходыСтруктураСтроки);
		
		мсвГрузы = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Грузы Цикл
			СтруктураСтрокиГрузы = Новый Структура("Заказ, ГрузовоеМесто, Количество, ЕдиницаИзмерения, СтоимостьГруза, Валюта,
			|ВесБрутто,Объем,КоличествоМест",,, 0, 0,,0,0,0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиГрузы, ТекСтрока);
			СтруктураСтрокиГрузы.Заказ          = ТекСтрока.ЗаказНаТС;
			СтруктураСтрокиГрузы.ГрузовоеМесто  = ТекСтрока.Номенклатура;
			СтруктураСтрокиГрузы.СтоимостьГруза = ТекСтрока.СтоимостьГруза;
			СтруктураСтрокиГрузы.Валюта         = ТекСтрока.Валюта;
			СтруктураСтрокиГрузы.ВесБрутто      = ТекСтрока.ВесБрутто;
			СтруктураСтрокиГрузы.Объем          = ТекСтрока.Объем;
			СтруктураСтрокиГрузы.КоличествоМест = ТекСтрока.КоличествоМест;
			мсвГрузы.Добавить(СтруктураСтрокиГрузы);
		КонецЦикла;
		Рез.Вставить("Грузы", мсвГрузы);
		
		мсвРасходы = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧРасходы Тогда
			Для Каждого ТекСтрока Из Объект.Расходы Цикл
				СтруктураСтрокиРасходы = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РасходыСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиРасходы, ТекСтрока);
				мсвРасходы.Добавить(СтруктураСтрокиРасходы);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Расходы", мсвРасходы);
	
	ИначеЕсли ИмяДокумента = "уатПотребностьВПеревозке_уэ" Тогда
		УслугиСтруктураСтроки = Новый Структура;
		УслугиСтруктураСтроки.Вставить("ID", "");
		УслугиСтруктураСтроки.Вставить("Количество", 0);
		УслугиСтруктураСтроки.Вставить("Цена", 0);
		УслугиСтруктураСтроки.Вставить("Сумма", 0);
		УслугиСтруктураСтроки.Вставить("СуммаНДС", 0);
		УслугиСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("Курс", 0);
		УслугиСтруктураСтроки.Вставить("Кратность", 0);
		УслугиСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("Тариф", ПредопределенноеЗначение("Справочник.уатТарифыТС.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		УслугиСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		УслугиСтруктураСтроки.Вставить("ПроцентСкидки", 0);
		УслугиСтруктураСтроки.Вставить("СуммаСкидки", 0);
		УслугиСтруктураСтроки.Вставить("СуммаСкидкиПлан", 0);
		
		Рез.Вставить("УслугиСтруктураСтроки", УслугиСтруктураСтроки);
		
		РасходыСтруктураСтроки = Новый Структура;
		РасходыСтруктураСтроки.Вставить("ID", "");
		РасходыСтруктураСтроки.Вставить("Количество", 0);
		РасходыСтруктураСтроки.Вставить("Цена", 0);
		РасходыСтруктураСтроки.Вставить("Сумма", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДС", 0);
		РасходыСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Курс", 0);
		РасходыСтруктураСтроки.Вставить("Кратность", 0);
		РасходыСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Тариф", ПредопределенноеЗначение("Справочник.уатТарифыТС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		РасходыСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		
		Рез.Вставить("РасходыСтруктураСтроки", РасходыСтруктураСтроки);
		
		мсвПункты = Новый Массив;
		Для Каждого ТекСтрока Из Объект.ПромежуточныеПункты Цикл
			СтруктураСтрокиПромежуточныеПункты = Новый Структура(
				"ID, Пункт, ТипТочкиМаршрута, ОтправительПолучатель, КонтактноеЛицо, Ожидание,
				|ПрибытиеПлан, УбытиеПлан, Стоянка, Расстояние, Время, Длительность"
			);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиПромежуточныеПункты, ТекСтрока);
			мсвПункты.Добавить(СтруктураСтрокиПромежуточныеПункты);
		КонецЦикла;
		Рез.Вставить("ПромежуточныеПункты", мсвПункты);
		
		мсвПунктыНазначения = Новый Массив;
		Для Каждого ТекСтрока Из Объект.ПунктыНазначения Цикл
			СтруктураСтрокиПунктыНазначения = Новый Структура(
			"ВесБрутто, Объем, КоличествоМест, Расстояние, ПробегСГрузом, ПробегПорожний, Время, Стоянка, СтоимостьГруза,"
			" СтоянкаПунктОтправления, СтоянкаПунктНазначения, ID, НомерСтроки, Грузоотправитель, Грузополучатель,"
			" АдресОтправления, АдресНазначения, ОбъектСтроительства, ТребованиеКТС, ТребованиеКТСТипТС, ТребованиеККлассу, ДатаОтправления,"
			" ДатаПрибытия, ВидПеревозки, НаправлениеПеревозки, FTL, Маршрут, ВидДоставки, ОтправлениеС, ПрибытиеПо, Перевозчик");
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиПунктыНазначения, ТекСтрока);
			мсвПунктыНазначения.Добавить(СтруктураСтрокиПунктыНазначения);
		КонецЦикла;
		Рез.Вставить("ПунктыНазначения", мсвПунктыНазначения);
		
		мсвТовары = Новый Массив;
		Для Каждого ТекСтрока Из Объект.ТоварныйСостав Цикл
			СтруктураСтрокиТоварныйСостав = Новый Структура("ID, Номенклатура, КоличествоМест, ГрузовоеМесто",,, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиТоварныйСостав, ТекСтрока);
			мсвТовары.Добавить(СтруктураСтрокиТоварныйСостав);
		КонецЦикла;
		Рез.Вставить("ТоварныйСостав", мсвТовары);
		
		мсвГрузовойСостав = Новый Массив;
		Для Каждого ТекСтрока Из Объект.ГрузовойСостав Цикл
			СтруктураСтрокиГрузовойСостав = Новый Структура("ID, ГрузовоеМесто, ВидУпаковки, КоличествоМест",,,, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиГрузовойСостав, ТекСтрока);
			мсвГрузовойСостав.Добавить(СтруктураСтрокиГрузовойСостав);
		КонецЦикла;
		Рез.Вставить("ГрузовойСостав", мсвГрузовойСостав);
		
		мсвВыработка = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Выработка Цикл
			СтруктураСтрокиВыработка = Новый Структура("ID, ПараметрВыработки, Значение",,, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыработка, ТекСтрока);
			мсвВыработка.Добавить(СтруктураСтрокиВыработка);
		КонецЦикла;
		Рез.Вставить("Выработка", мсвВыработка);
		
		мсвДоходы = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧДоходы Тогда
			Для Каждого ТекСтрока Из Объект.Услуги Цикл
				Если ЗначениеЗаполнено(ДопПараметры.IDСтрокиПотребности)
					И ТекСтрока.ID <> ДопПараметры.IDСтрокиПотребности Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураСтрокиУслуги = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(УслугиСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиУслуги, ТекСтрока);
				мсвДоходы.Добавить(СтруктураСтрокиУслуги);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Услуги", мсвДоходы);
		
		мсвРасходы = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧРасходы Тогда
			Для Каждого ТекСтрока Из Объект.Расходы Цикл
				Если ЗначениеЗаполнено(ДопПараметры.IDСтрокиПотребности)
					И ТекСтрока.ID <> ДопПараметры.IDСтрокиПотребности Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураСтрокиРасходов = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РасходыСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиРасходов, ТекСтрока);
				мсвРасходы.Добавить(СтруктураСтрокиРасходов);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Расходы", мсвРасходы);
		
	ИначеЕсли ИмяДокумента = "такАрендаТС" Тогда
		УслугиСтруктураСтроки = Новый Структура;
		УслугиСтруктураСтроки.Вставить("Количество", 0);
		УслугиСтруктураСтроки.Вставить("КоличествоПлан", 0);
		УслугиСтруктураСтроки.Вставить("Цена", 0);
		УслугиСтруктураСтроки.Вставить("ЦенаПлан", 0);
		УслугиСтруктураСтроки.Вставить("Сумма", 0);
		УслугиСтруктураСтроки.Вставить("СуммаПлан", 0);
		УслугиСтруктураСтроки.Вставить("СуммаНДС", 0);
		УслугиСтруктураСтроки.Вставить("СуммаНДСПлан", 0);
		УслугиСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("Курс", 0);
		УслугиСтруктураСтроки.Вставить("Кратность", 0);
		УслугиСтруктураСтроки.Вставить("Содержание", "");
		УслугиСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("Тариф", ПредопределенноеЗначение("Справочник.уатТарифыТС.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СтатьяДоходов", ПредопределенноеЗначение("Справочник.уатСтатьиДоходов.ПустаяСсылка"));
		УслугиСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		УслугиСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		УслугиСтруктураСтроки.Вставить("ПроцентСкидки", 0);
		УслугиСтруктураСтроки.Вставить("СуммаСкидки", 0);
		УслугиСтруктураСтроки.Вставить("СуммаСкидкиПлан", 0);
		УслугиСтруктураСтроки.Вставить("ВидДокумента", ПредопределенноеЗначение("Перечисление.уатВидыДокументовШаблонаДоходовРасходов_уэ.ПустаяСсылка"));
		Рез.Вставить("УслугиСтруктураСтроки", УслугиСтруктураСтроки);
		
		// ТЧ Доходы
		мсвУслуги = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧДоходы Тогда
			Для Каждого ТекСтрока Из Объект.Услуги Цикл
				СтруктураСтрокиУслуги = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(УслугиСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиУслуги, ТекСтрока);
				мсвУслуги.Добавить(СтруктураСтрокиУслуги);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Услуги", мсвУслуги);
		
		РасходыСтруктураСтроки = Новый Структура;
		РасходыСтруктураСтроки.Вставить("Количество", 0);
		РасходыСтруктураСтроки.Вставить("Цена", 0);
		РасходыСтруктураСтроки.Вставить("Сумма", 0);
		РасходыСтруктураСтроки.Вставить("СуммаНДС", 0);
		РасходыСтруктураСтроки.Вставить("Валюта", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("УчитыватьНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("СуммаВключаетНДС", Ложь);
		РасходыСтруктураСтроки.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Содержание", "");
		РасходыСтруктураСтроки.Вставить("Тариф", Неопределено);
		РасходыСтруктураСтроки.Вставить("Контрагент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("Договор", ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СтатьяРасходов", ПредопределенноеЗначение("Справочник.уатСтатьиРасходов.ПустаяСсылка"));
		РасходыСтруктураСтроки.Вставить("СписокФильтров", Неопределено);
		РасходыСтруктураСтроки.Вставить("ЗначенияГруппировок", Неопределено);
		Рез.Вставить("РасходыСтруктураСтроки", РасходыСтруктураСтроки);
		
		// ТЧ Расходы
		мсвТЧ = Новый Массив;
		Если ДопПараметры.ЗаполнятьТЧРасходы Тогда
			Для Каждого ТекСтрока Из Объект.Расходы Цикл
				СтруктураСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РасходыСтруктураСтроки);
				ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекСтрока);
				мсвТЧ.Добавить(СтруктураСтроки);
			КонецЦикла;
		КонецЕсли;
		Рез.Вставить("Расходы", мсвТЧ);
		
		мсвВыработка = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Выработка Цикл
			СтруктураСтрокиВыработка = Новый Структура("ПараметрВыработки, Значение",, 0);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыработка, ТекСтрока);
			мсвВыработка.Добавить(СтруктураСтрокиВыработка);
		КонецЦикла;
		Рез.Вставить("Выработка", мсвВыработка);
		
	Иначе
		Для Каждого ТекТЧ Из уатРаботаСМетаданными.ТабличныеЧастиДокумента(ИмяДокумента) Цикл
			мсвТЧ = Новый Массив;
			Для Каждого ТекСтрока Из Объект[ТекТЧ.Ключ] Цикл
				СтруктураСтроки = Новый Структура;
				Для Каждого ТекРеквизитТЧ Из ТекТЧ.Значение Цикл
					СтруктураСтроки.Вставить(ТекРеквизитТЧ, ТекСтрока[ТекРеквизитТЧ]);
				КонецЦикла;
				мсвТЧ.Добавить(СтруктураСтроки);
			КонецЦикла;
			Рез.Вставить(ТекТЧ.Ключ, мсвТЧ);
		КонецЦикла;
			
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

// Обрезает полное имя формы до имени объекта метаданных
//
// Параметры:
//  ИмяФормы - Строка - Полное имя формы
// 
// Возвращаемое значение:
//   - 
//
Функция ОбрезатьИмяФормы(ИмяФормы) Экспорт
	
	МассивСтрок = СтрРазделить(ИмяФормы,".");
	Если МассивСтрок.Количество() > 1 Тогда
		Возврат МассивСтрок[1];
	Иначе
		Возврат ИмяФормы;
	КонецЕсли;
	
КонецФункции

// Процедура отображает иконку статуса сопроводительных документов в списках Маршрутных листов и Заказов на ТС.
// Вызывается из события дин. списка ПриПолученииДанныхНаСервере.
// 
Процедура ОтобразитьСтатусСДПриПолученииДанныхНаСервере(СтрокиДинамическогоСписка, ИмяКолонкиСтатус = "СтатусВыполненияДокументов") Экспорт
	// 1) получаем список оснований СД по всем строкам
	мсвОснования = Новый Массив;
	Для Каждого ТекСтрока Из СтрокиДинамическогоСписка Цикл
		// В данных строки может не оказаться ссылки, это нестандартная ситуация, вывести статус невозможно
		Попытка
			ТекДанныеКартинки = ТекСтрока.Значение.Данные[ИмяКолонкиСтатус];
			мсвОснования.Добавить(ТекСтрока.Значение.Данные.Ссылка);
		Исключение
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
	// 2) по списку оснований СД получаем итоговые статусы СД
	соотвСтатусыОснований = уатОбщегоНазначения_проф.ПолучитьСоответствиеСтатусовСДпоДокументам(мсвОснования);
	
	// 3) устанавливаем значения иконки статусов в данные строк
	Для Каждого ТекСтрока Из СтрокиДинамическогоСписка Цикл
		ТекИконка = соотвСтатусыОснований.Получить(ТекСтрока.Значение.Данные.Ссылка);
		Если ТекИконка = Неопределено Тогда
			ТекИконка = 0;
		КонецЕсли;
		ТекСтрока.Значение.Данные[ИмяКолонкиСтатус] = ТекИконка;
	КонецЦикла;
КонецПроцедуры

// Функция возвращает номер документа без префикса организации и лидирующих нулей в записи
// для размещения на печатной форме
//
// Параметры:
//    НомерОбъекта - Строка - номер или код объекта, который преобразуется для вывода на печать.
//    УдалитьПрефиксИнформационнойБазы - Булево - признак удаления префикса информационной базы.
//    УдалитьПользовательскийПрефикс - Булево - признак удаления пользовательского префикса.
// 
// Возвращаемое значение:
//   - Строка - Отформатированный номер документа
//
Функция НомерДокументаНаПечать(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы = Ложь, УдалитьПользовательскийПрефикс = Ложь) Экспорт	
	Возврат ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерОбъекта, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
КонецФункции

// Функция формирует структуру данных необходимых для выполнения процедуры 
// уатОбщегоНазначенияКлиент_уэ.ФактическоеПосещениеПунктовПоДаннымМониторинга
//
Функция ПодготовитьСтрДанныхДляОпределенияФактПосещениеПунктовПоДаннымССМ(Знач Объект, Знач ДанныеОбъекта, ЗаполнениеИзАРМКонтрольПеревозок, флОшибка = Ложь) Экспорт
	
	Ссылка		 = Объект.Ссылка;
	ТипОбъекта	 = ТипЗнч(Ссылка);
	
	ДанныеПоМаршрутномуДокументу = Новый Структура();
	
	Если НЕ ТипОбъекта = Тип("ДокументСсылка.уатПутевойЛист") И НЕ ТипОбъекта = Тип("ДокументСсылка.уатМаршрутныйЛист")Тогда
		ТекстНСТР = НСтр("en='This type of document is not supported.';ru='Данный вид документа не поддерживается.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		флОшибка = Истина;
		Возврат ДанныеПоМаршрутномуДокументу;
	КонецЕсли;
	
	УчетПланФактаВПутевыхЛистах = Ложь;
	Если ТипОбъекта = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		ТС = Объект.ТранспортноеСредство;
		УчетПланФактаВПутевыхЛистах = уатОбщегоНазначения_проф.УчетПланФактаВПутевыхЛистах();
	Иначе
		ТС = Объект.ТС;
	КонецЕсли;
	
	ДатаС  = Неопределено;
	Данные = Новый Массив(); 
	Для Каждого ТекСтрока Из ДанныеОбъекта Цикл
		СтруктураДанных = Новый Структура("МаршрутныйДокумент, НомерЕздки, НомерСтроки, Выполнен, ПрибытиеФакт, УбытиеФакт,
		|АдресПрибытия, АдресУбытия, ПрибытиеПлан, УбытиеПлан, РасстояниеФакт, ВремяФакт, Расстояние, Время");
		Если ЗаполнениеИзАРМКонтрольПеревозок Тогда
			СтруктураДанных.МаршрутныйДокумент	 = Ссылка;
			СтруктураДанных.НомерЕздки			 = ТекСтрока.НомерЕздки;
			СтруктураДанных.НомерСтроки			 = ТекСтрока.НомерСтроки;
			СтруктураДанных.Выполнен			 = ТекСтрока.Выполнен;
			СтруктураДанных.ПрибытиеФакт		 = ТекСтрока.ПрибытиеФакт;
			СтруктураДанных.УбытиеФакт			 = ТекСтрока.УбытиеФакт;
			СтруктураДанных.АдресПрибытия		 = ТекСтрока.Пункт;
			СтруктураДанных.АдресУбытия			 = ТекСтрока.АдресУбытия;
			СтруктураДанных.ПрибытиеПлан		 = ТекСтрока.ПрибытиеПлан;
			СтруктураДанных.УбытиеПлан			 = ТекСтрока.УбытиеПлан; 
			
			Если ДатаС = Неопределено Тогда
				ДатаС = ТекСтрока.ПрибытиеПлан;
			КонецЕсли;
			ДатаПо = ТекСтрока.УбытиеПлан;
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.уатМаршрутныйЛист") Тогда
			СтруктураДанных.МаршрутныйДокумент	 = Ссылка;
			Если Не ЗначениеЗаполнено(ТекСтрока.GUIDСтроки) Тогда
				ТекСтрока.GUIDСтроки = Новый УникальныйИдентификатор;
			КонецЕсли;
			СтруктураДанных.НомерСтроки			 = ТекСтрока.GUIDСтроки;
			СтруктураДанных.Выполнен			 = ТекСтрока.Выполнен;
			СтруктураДанных.ПрибытиеФакт		 = ТекСтрока.ПрибытиеФакт;
			СтруктураДанных.УбытиеФакт			 = ТекСтрока.УбытиеФакт;
			СтруктураДанных.АдресПрибытия		 = ТекСтрока.Пункт;
			СтруктураДанных.ПрибытиеПлан		 = ТекСтрока.ПрибытиеПлан;
			СтруктураДанных.УбытиеПлан			 = ТекСтрока.УбытиеПлан; 
			
			Если ДатаС = Неопределено Тогда
				ДатаС = ТекСтрока.ПрибытиеПлан;
			КонецЕсли;
			ДатаПо = ТекСтрока.УбытиеПлан;
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.уатПутевойЛист") Тогда
			СтруктураДанных.МаршрутныйДокумент	 = Ссылка;
			СтруктураДанных.НомерЕздки			 = ТекСтрока.НомерЕздки;
			СтруктураДанных.НомерСтроки			 = ТекСтрока.НомерСтроки;
			СтруктураДанных.Выполнен			 = ТекСтрока.Выполнено;
			Если УчетПланФактаВПутевыхЛистах Тогда
				СтруктураДанных.ПрибытиеФакт	 = ТекСтрока.ВремяПрибытияФакт;
				СтруктураДанных.УбытиеФакт		 = ТекСтрока.ВремяУбытияФакт;
				СтруктураДанных.ПрибытиеПлан	 = ТекСтрока.ВремяПрибытия;
				СтруктураДанных.УбытиеПлан		 = ТекСтрока.ВремяУбытия;
			Иначе
				СтруктураДанных.ПрибытиеФакт	 = ТекСтрока.ВремяПрибытия;
				СтруктураДанных.УбытиеФакт		 = ТекСтрока.ВремяУбытия;
				СтруктураДанных.ПрибытиеПлан	 = ТекСтрока.ВремяПрибытия;
				СтруктураДанных.УбытиеПлан			 = ТекСтрока.ВремяУбытия;
			КонецЕсли;
			СтруктураДанных.АдресПрибытия		 = ТекСтрока.АдресПрибытия;
			СтруктураДанных.АдресУбытия			 = ТекСтрока.АдресУбытия;   
			
			Если ДатаС = Неопределено Тогда
				ДатаС = ТекСтрока.ВремяПрибытия;
			КонецЕсли;
			ДатаПо = ТекСтрока.ВремяУбытия;
		КонецЕсли;  
		Данные.Добавить(СтруктураДанных);
	КонецЦикла;
	
	ДанныеПоМаршрутномуДокументу.Вставить("ТипОбъекта",						 ТипОбъекта);
	ДанныеПоМаршрутномуДокументу.Вставить("Ссылка",							 Ссылка);
	ДанныеПоМаршрутномуДокументу.Вставить("ТС",								 ТС);
	ДанныеПоМаршрутномуДокументу.Вставить("ДатаС",							 ДатаС);
	ДанныеПоМаршрутномуДокументу.Вставить("ДатаПо",							 ДатаПо);
	ДанныеПоМаршрутномуДокументу.Вставить("Данные",							 Данные);
	
	Возврат ДанныеПоМаршрутномуДокументу;

КонецФункции

// Функция возвращает значение ячейки табличного документа
//
Функция ПолучитьЗначениеЯчейкиТабличногоДокумента(ЯчейкаФайла, ТипЗначения) Экспорт
		
	Попытка
		Если ТипЗнч(ЯчейкаФайла) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда 
			ТекстЯчейки = ЯчейкаФайла.Текст;
		ИначеЕсли ТипЗнч(ЯчейкаФайла) = Тип("COMОбъект") Тогда 
			ТекстЯчейки = ЯчейкаФайла.Text;
		Иначе 
			ТекстЯчейки = ЯчейкаФайла;
		КонецЕсли;
		
	Исключение
		ТекстЯчейки = "";
	КонецПопытки;
	
	Попытка
		Если ТипЗнч(ЯчейкаФайла) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда 
			ЗначениеЯчейки = ЯчейкаФайла.Значение; 
		ИначеЕсли ТипЗнч(ЯчейкаФайла) = Тип("COMОбъект") Тогда 
			ЗначениеЯчейки = ЯчейкаФайла.Value;
		Иначе 
			ЗначениеЯчейки = ЯчейкаФайла;
		КонецЕсли;
		
	Исключение
		ЗначениеЯчейки = Неопределено;
	КонецПопытки;
	
	Если ТипЗначения = Тип("Число") Тогда 
		Если ЗначениеЯчейки <> Неопределено Тогда
			Попытка
				Возврат ЗначениеЯчейки;
			Исключение
			КонецПопытки;
		КонецЕсли;
	
		Попытка
			Возврат Число(ТекстЯчейки);
		Исключение
			Возврат 0;
		КонецПопытки;
		
		ВызватьИсключение НСтр("en='Invalid cell value';ru='Некорректное значение в ячейке'");
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Попытка
			Если ЗначениеЯчейки = Неопределено
				И ТипЗнч(ТекстЯчейки) = Тип("Строка") Тогда
				Возврат ПреобразоватьСтрокуВДату(ТекстЯчейки);
			ИначеЕсли ТипЗнч(ЗначениеЯчейки) = Тип("Строка") Тогда 
				Возврат ПреобразоватьСтрокуВДату(ЗначениеЯчейки);
			ИначеЕсли ТипЗнч(ЗначениеЯчейки) = Тип("Число") Тогда 
				Возврат ПреобрабоватьЧислоВДату(ЗначениеЯчейки);
			ИначеЕсли (ЗначениеЯчейки <> Неопределено) Тогда 
				Возврат ЗначениеЯчейки;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			Возврат Дата(ТекстЯчейки);
		Исключение
			Возврат ТекстЯчейки;
		КонецПопытки;
		
		ВызватьИсключение НСтр("en='Invalid cell value';ru='Некорректное значение в ячейке'");
		
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда 
		Возврат СокрЛП(ТекстЯчейки);
		
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда 
		Возврат ЗначениеЗаполнено(СокрЛП(ТекстЯчейки)); 
	Иначе 
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			Если ТипЗначения = Тип("СправочникСсылка.уатТС") Тогда
				Возврат Справочники.уатТС.НайтиПоНаименованию(ТекстЯчейки); 
			КонецЕсли;
		#КонецЕсли
		ВызватьИсключение НСтр("en='Unsupported data type specified';ru='Указан неподдерживаемый тип данных'");
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеЯчейки()

Функция ПреобразоватьСтрокуВДату(Знач ДатаСтрокой) Экспорт
	
	РазделительДаты = ".";
	флЕстьДата = Не СтрНайти(ДатаСтрокой, РазделительДаты) = 0;
	
	Если Не флЕстьДата Тогда 
		РазделительДаты = "/";
		флЕстьДата = Не СтрНайти(ДатаСтрокой, РазделительДаты) = 0;
	КонецЕсли;
	
	флЕстьВремя   = Не СтрНайти(ДатаСтрокой, ":") = 0;
	флЕстьСекунды = СтрЧислоВхождений(ДатаСтрокой, ":") = 2;
	
	Если Не флЕстьДата И Не флЕстьВремя Тогда 
		Возврат '00010101';
	КонецЕсли;
	
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ".", Символы.ПС);
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "/", Символы.ПС);
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ":", Символы.ПС);
	Пока Найти(ДатаСтрокой, "  ") > 0 Цикл
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "  ", " ");
	конеццикла;
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, " ", Символы.ПС);
	
	НомерГод = ?(флЕстьДата, ?(РазделительДаты = "/", 3, 3), 0);
	НомерМес = ?(флЕстьДата, ?(РазделительДаты = "/", 1, 2), 0);
	НомерДен = ?(флЕстьДата, ?(РазделительДаты = "/", 2, 1), 0);
	НомерЧас = ?(флЕстьВремя, ?(флЕстьДата, 4, 1), 0);
	НомерМин = ?(флЕстьВремя, ?(флЕстьДата, 5, 2), 0);
	НомерСек = ?(флЕстьВремя, ?(флЕстьДата, ?(флЕстьСекунды, 6, 0), ?(флЕстьСекунды, 3, 0)), 0);
	
	Попытка
		Дата1С = Дата(
			?(НомерГод = 0, 1, Число(СтрПолучитьСтроку(ДатаСтрокой, НомерГод))),
			?(НомерМес = 0, 1, Число(СтрПолучитьСтроку(ДатаСтрокой, НомерМес))), 
			?(НомерДен = 0, 1, Число(СтрПолучитьСтроку(ДатаСтрокой, НомерДен))), 
			?(НомерЧас = 0, 0, Число(СтрПолучитьСтроку(ДатаСтрокой, НомерЧас))), 
			?(НомерМин = 0, 0, Число(СтрПолучитьСтроку(ДатаСтрокой, НомерМин))), 
			?(НомерСек = 0, 0, Число(СтрПолучитьСтроку(ДатаСтрокой, НомерСек)))
		);
		
	Исключение
		Дата1С = '00010101';
	КонецПопытки;
	
	Возврат Дата1С;
	
КонецФункции // ПреобразоватьСтрокуВДату()

Функция ПреобрабоватьЧислоВДату(Знач КоличествоДней) Экспорт
	
	Попытка
		КоличествоЧасов = КоличествоДней * 24;
		
		Часов = Цел(КоличествоЧасов);
		Минут = Окр((КоличествоЧасов - Часов) * 60, 2);
		
		КоличествоСекунд = (Часов * 3600) + (Минут * 60);
		
		Дата1С = '00010101' + КоличествоСекунд;
		
	Исключение
		Дата1С = '00010101';
	КонецПопытки;
	
	Возврат Дата1С;
	
КонецФункции

#КонецОбласти
